{"sections":[{"number":1,"complete":true,"content":"Impol D.O.O iz Slovenske Bistrice je privredno društvo sa zavidnom poslovnom tradicijom koja datira još od 1825. godine, a preradom aluminijuma bavi se od 1950. Delatnost poslovne grupe IMPOL je prerada aluminijuma u valjane, presovane, vučene, kovane, i druge vrste proizvoda koji se mogu upotrebljavati u automobilskoj i avio industriji, mašinogradnji, transportu, unutrašnjem dizajnu, elektro-industriji i građevinskoj industriji. . U Impol-u je zaposleno 2525 radnika koji proizvedu i prodaju preko 110 000 tona proizvoda godišnje. Najvažnija tržišta su tržište Nemačke, Italije, Mađarske, Holandije, zemalja Latinske Amerike, Francuske i Austrije. Poslovna grupa IMPOL obuhvata 21 privredno društvo a njeno matično društvo je IMPOL 2000, d.d. U oktobru 2002. godine IMPOL d.d. je postao vlasnik 70% akcija Valjaonice Aluminijuma iz Sevojna.  Valjaonica Impol Seval ima 550 zaposlenih.\r\n\r\n\r\nValjaonica je počela sa radom 1975. godine sa instaliranim kapacitetima od 35.000 tona valjanih aluminijumskih proizvoda. Završetkom druge faze od 16.500 tona programa tankih traka postavljen je projektovani kapacitet od 51.500 tona hladno valjanih proizvoda. Do 1989. godine Valjaonica Aluminijuma iz Sevojna je poslovala u sastavu SOUR Valjaonica Sevojno, a potom, godinu dana (1990) kao jedinstveno preduzeće Valjaonica Bakra i aluminijuma Sevojno. Početkom 1991. Valjaonica aluminijuma nastavlja da posluje samostalno, sa pogonom Finalizacije u svom sastavu. Svojinska transformacija preduzeća izvršena je tenderskom prodajom u oktobru 2002. godine, a vlasnik 70% kapitala postaje IMPOL d.d. Slovenska Bistrica. Od tada Valjaonica nastupa na tržištu pod imenom IMPOL SEVAL Valjaonica aluminijuma a.d. Sevojno. IMPOL SEVAL Valjaonica aluminijuma a.d. Sevojno je najveći prerađivač aluminijuma u Republici Srbiji i jedini proizvođač valjanih proizvoda od aluminijuma, ima višedecenijsku tradiciju u preradi aluminijuma i visok ugled kako na domaćem, tako i na svetskom tržištu, posebno u Evropi i Americi. Impol Seval Valjaonica Aluminijuma Sevojno je danas akcionarsko društvo sa tri ćerke firme: Impol Seval Tehnika, Impol Seval PKC, Impol Seval Final i ima preko 550 zaposlenih.\r\n\r\nAsortiman proizvoda Impol Seval valjaonice aluminijuma obuhvata sledeće proizvode: bojene trake i limovi, hladno valjane trake, toplo valjane trake, toplo valjane ploče, limove i trupce. Najperspektivniji proizvod valjaonice jeste bojeni aluminijum i on je ujedno i proizvod sa najvećom dodatnom vrednošću. Obojeni aluminijum Valjaonice IMPOL SEVAL Sevojno može se naći u konstrukciji mnogih svetskih poznatih građevina, kao što su: Stadion Lužnjiki u Moskvi koji je služio za otvaranje Svetskog prvenstva u fudbalu 2018. godine, Moskovski metro, Moskovski aerodrom, Humo Arena u Uzbekistanu  i mnoge druge građevine.  Proizvodi Impol Sevala arhitektama dozvoljavaju slobodu i maštovitost i kao što je rekao generalni direktor i vlasnik kompanije ALUWALL, Stanislav Kovaljev: ,,Zadovoljavaju najstrože i najzahtevnije zamisli i ideje arhitekata, omogućavajući veliki broj čitavih paleta boja, nijansi i faktura bojenog aluminijuma”. Sa obzirom da kvalitet proizvoda zavisi od stepena modernizacije proizvodnih sistema, Valjaonica je potrošila 90 miliona evra u razvoju proizvodnih kapaciteta u poslednih 15 godina. Na osnovu toga, može se reći da su Valjaonici Impol Seval Sevojno nema reči o pukom valjanju i bojenju već o gotovo umetničkom duhu i marljivom predavanju radu.\r\n\r\n\r\nŠto se tržišta tiče, Impol Seval valjaonica Aluminijuma je fabrika sa četrdeset godina iskustva u preradi aluminijuma pa je samim tim rezultat toga brzo prilagođavanje zahtevima tržišta i potrebama kupaca, što je doprinelo visokom ugledu i prepoznavanju brenda kod mnogobrojnih kupaca na tržištu Evrope (Nemačka, Italija, Francuska, Austrija, Holandija, Švajcarska...), Rusije i širom sveta. Impol Seval izrađuje proizvode od aluminijuma i njegovih legura, postupcima livenja, toplog valjanja i hladnog valjanja. Proizvodi se izrađuju po zahtevima kupaca i svetskim standardima, u ekološko kontrolisanoj sredini i koriste se u: automobilskoj, prehrambenoj, farmaceutskoj, transportnoj industriji, elektroindustriji i građevinarstvu. Gotova roba doprema se kupcima na najfleksibilniji način korišćenjem šlepera  nosivosti do 25 tona. Vrednost izvoza Valjaonice samo za 2017. godinu iznosi 97,3 miliona evra. Ukupna proizvodnja za tržište 2022. godine je iznosila 1 076 710 tona proizvoda, od čeka se 95% koristi kao izvoz u razne zemlje sveta. Za plasman datih proizvoda na probirljivom svetskom tržištu neophodna je i logistička podrška laboratorije, koja je opremljena najsavremenijom opremom i sprovodi hemijska, mehanička i tehnološka ispitivanja. Valjaonica posluje u skladu sa standardom ISO 9000:2001.\r\n\r\nNakon svoje prve posete firmi, upoznavanja sa delatnostima firme i kadrovima, akcentovao bih organizovanost i međusobnu povezanost zaposlenih u cilju obavljanja postavljenih i predviđenih redosleda složenih zadataka. U okviru menadžmenta preduzeća, kao poseban element izdvojio bih poštovanje pravila poverljivosti. Na osnovu Ugovora koji je potrebno potpisati, obuhvataju se opšte napomene i posebna pravila koja se odnose na treća lica odnosno posetioce Društva koja se po bilo kom osnovu nalaze u radnoj okolini. Od posetilaca se traži da poštuju polise firme o poverljivim informacijama i da se zalažu da date informacije neće zloupotrebiti.\r\nTakođe bih iz svoje prve posete istakao bezbednost kadrova koja je dignuta na visok nivo, gde bezbednost predstavlja jedan od najvažnijih elemenata poslovanja firme. Ona podrazumeva zabranu kretanja bez prisustva mentora ili ovlašćenog zaposlenog i u odgovarajućim zonama kretanja je potrebno imati zaštitnu opremu kao i ovlašćeno lice pored sebe. Posetiocima se takođe daje Ugovor kojim se obavezuju da će poštovati pravila o bezbednosti na radu prilikom poset\r\nDrugog radnog dana sam upoznat sa funkcionisanjem informacionog sektora firme, njegovom infrastrukturom i telekomunikacijama, hardverom i radom zaposlenih.\r\nInformacioni sektor firme se nalazi u okviru posebnog objekta i izdvojen je od izvesnog broja sektora, pa tako i od proizvodnje firme. Zaposleni u ovom sektoru obavljaju široki raspon informatičkih zadataka, od servisa personalnih računara, preko održavanja-unapređenja postojeće računarske mreže, do pisanja-održavanja-unapređivanja sopstvenog informacionog sistema/softvera firme. Informacionu i komunikacionu strukturu mreže valjaonice možemo videti na sledećoj slici:\r\n \r\nSa slike možemo videti da se komunikacija sa serverima i mrežom u Slovenskoj Bistrici vrši preko dva linka, jedan direktan link sa Slovenijom preko Telesistema, optički link od 20 Mbit/s i on služi za direktnu komunikaciju sa serverima u Sloveniji. Sa obzirom da sve mora da funkcioniše u redudansi, jer valjaonica ne može dozvoliti pad mreže, u slučaju pada jednog linka prebacuje se na drugi, rezervni link od 200 Mbit/s koji je takođe preko optike (Telekomov link), pa korisnici ne osećaju da je uopšte došlo do promene prilikom pada jednog od linkova. Optički prsten linkova i redudansa omogućavaju što manji rizik od prekida mreže. Na samom ulazu u mrežu imamo dva firewall-a koji su takođe u redudansi i  koriste kompletnu mrežu (tipovi firewall-ova su Palo Alto PA-820). Takođe, mreža sadrži centralne svičeve koji su raspoređeni u hijerarhiji, od centralnog sviča Cisco Catalyst 4500, preko Cisco Catalyst 3850 do Cisco Catalyst 2960. Računarska mreža valjaonice je u osnovi napravljena 2003. godine i tada se koristila multimodna optika, od 2018. se prelazi na singlmodnu optiku koja nema ograničenja u brzini i omogućuje usluge High Speed Internet-a. Između svičeva se koristi singlmodna optika, gde se multimodna pojavljuje vrlo retko. Brzina interneta od 10 gigabita po sekundi predstavlja kičmu mreže tako da nema problema sa brzinom protoka podataka. Potrebno je napomenuti da postoji i ugrađena bežična mreža, gde su veliki troškovi održavanja i licenciranja bežične mreže. Za kontrolu bežične mreže se koristi Cisco Catalyst 9800 bežični kontroler koji zapravo nije deo hardvera (ne postoji fizički, već je instaliran) i on upravlja svim pristupnim tačkama valjaonice. Pristupne tačke su postavljene na svakih 50 metara u pogonu i zaposlenima je veoma bitno da odgovarajući uređaji, kao što je bar kod čitač, mogu brzo preći sa jedne pristupne tačke na drugu. Prikaz dela informacionog sektora firme:\r\n\r\n\r\n U informacionoj komunikacionoj strukturi valjaonice koriste se sledeći serveri: DNS serveri (centri podataka koji služe za povezivanje sa dva velika centra u Sloveniji), File server, LDAP, RDP, server aplikacije za evidenciju radnog vremena, server aplikacije za obradu zarada, server za skeniranje E-fakture. U Sloveniji postoje backup-ovi svih servera, gde se održavanje podataka vrši svakog dana u 22:00. Kao server se  koristi Lenovo SR350, kao diskovni sistem se koristi IBM skladište, za dodeljivanje memorije i procesora imamo VMWhare za kog se plaćaju odgovarajuće licence. Firma Arhides je odgovorna za celokupnu hardversku i informaciono komunikacionu infrastrukturu valjaonice.\r\n\r\nImpol Seval a.d. poseduje lokalnu telefonsku i računarsku mrežu kojom su pokrivene sve administrativne i proizvodne celine. Lokalna računarska mreža je izvedena kombinacijom optičkih i bakarnih kablova, tako da su proširenja moguća i lako izvodljiva. Računarska mreža se sastoji od više čvorišta, gde se nalaze ormari sa aktivnom i pasivnom računarskom opremom, vezanih u prsten. Do svih čvorova dolazi optički (multimodni i singlmodni) kablovi za računarsku i višeparični bakarni za telefonsku mrežu. Optičkim kablovima su povezane i sve mašine u pogonu, jer se bakarni kablovi ne mogu koristiti zbog velikih elektro magnetnih smetnji. Bakarni SFTP kablovi su korišćeni za povezivanje od ormara do radnog mesta. Istim kablovima se prenosi i računarska i telefonska veza. \r\nRačunare firme možemo razvrstati na NC (Network Client) radne stanice, personalne računare sa operativnim sistemima Win2003, Tao-Linux, RedHat, Win98, WinXP, WinVista i Win7.\r\nIP blokovi adresa koji se kriste u mrežama su 10.50.10.0/24 i 20.50.10.0/24 a dalje je planski predviđeno deljenje prema potrebama firme u sistemu\r\n-od 1 do 29 – namenjeno štampačima;\r\n-od 30 do 200 – namenjeno za PC-je;\r\n-od 201 do 254 – namenjeno za NC-je.\r\n\r\nTelefonski saobraćaj se odvija preko sopstvene centrale GrandStream UCM6302, koja se može proširivati. Trenutno na centralni je instalirano 30 IP telefonskih priključaka i 192 analogna lokala različitih prioriteta. Veza sa Softnet serverima ostvaruje se preko 2 MB/s tunela odvojenog od Telekomovog link High Speed Internet. Impol Seval poseduje numeraciju za 300 brojeva od 031 591 100 do 031 591 400. Pored fiksnih telefonskih linija, Impol Seval a.d. poseduje Biznis paket 150 mobilnih telefona. Mobilne telefone poseduju svi rukovodioci, poslovođe i zaposleni na radnim mestima od bitnog značaja za funkcionisanje proizvodnje. Što se tiče bezbednosti, perimetar je zaštićen sistemom Fiber-fance, koji je integrisan sa pokretnim kamerama. Video zapis se redovno snima i čuva, a monitoring se vrši 24 časova dnevno. Za monitoring zadužena je Valjaonica bezbednost. Video kamerama su pokriveni i pojedini delovi proizvodnje. Ove kamere su integrisane u lokalnu računarsku mrežu Impol Seval i video zapisi se skladište na dva lokalna NVR uređaja.\r\n\r\n \r\n\r\n\r\n\r\nSvog trećeg radnog dana bio sam upoznat sa softverom, aplikacijama, programima i bazom podataka valjaonice. Slovenačka firma Alcad je zadužena za održavanje i upravljanje softverom Valjaonice Impol Seval Sevojno i predstavlja web aplikaciju koja uključuje segmente kao što su Klasifikacija, Reporter, E-računi, HRM 4.0, DNA…  Pre privatizacije valjaonice zaposleni su pravili lokalne programe za svoje potrebe. Jedni od takvih programa su Nikola i Seval. Danas se uglavnom koriste gotove aplikacije za unos podataka, pravljenje izveštaja, knjigovodstvo, platne programe, osobne dobitke, evidenciju radnog vremena, evidenciju i nabavku osnovnih sredstava. Za praćenje proizvodnje se koristi slovenački program PIS (Proizvodno Informacioni Sistem) koji podrazumeva: praćenje proizvodnih poslova, prodajnih poslova, administrativnih poslova, praćenje nivoa skladišta, odpremnica i nabavnih poslova. Pored navedenih koriste se i sledeći slovenački programi: MIS, LIS, NAMIS, SIRENA (program za finansije), Atesti (program razvijen u Javi). Treba pomenuti i programe koji se koriste na računarima vezanim za kvantometre (hemijska analiza aluminijuma i Al legura) i računarima vezanim za kidalice (mehanička ispitivanja uzoraka od aluminijuma i Al legura).\r\nNikola je lokalni mrežni softver razvijen od strane zaposlenog Nikole Radojčića putem programskog okruženja Delphi, i služi za obradu podataka iz procesa koji nisu obuhvaćeni glavnim softverom za praćenje proizvodnje. Program je u stalnom razvoju od 2000-te godine i pruža mogućnosti praćenja podataka o računarima, zaposlenima, odeljku za posete, ličnom dohotku, daje mogućnost ocene radnika, evidenciju tehničke dokumentacije, sadrži u sebi i program za merno-kontrolna sredstva, program za reklamacije, evidencije kupaca i evidencije država za izvoz. Ukratko, program Nikola se koristi za internu evidenciju: praćenje kadrova i najrazličitijih procesa u firmi. \r\nU biti svega je baza podataka Paradox kao tip baze kojo pristupa program radi rada sa podacima u lokalu (lokalna baza podataka). Sam program je pisan OOP načinom, uz poštovanje brojnih konvencija. Odgovarajući pristup podacima je dostupan na svim radnim stanicama u firmi, u skladu sa odgovarajućim ovlašćenjima i odgovornostima. Prema tome, odgovarajuće jedinice programa su dostupne licima koje rade sa njima, i to u prilagođenom obliku: mogućnost ažuriranja podataka, pregled podataka, upis-brisanje podataka itd. Dakle,  u dogovoru sa menadžmentom i ostalim zaposlenima, dodeljene su odgovarajuće privilegije, koje je moguće menjati putem prigodnog interfejsa. U bazi programa postoji oko 50 tabela od kojih se kao najbitnije mogu istaći tabele vezane za radnike, reklamacije, prolaske i izlaznice iz firme, sirovine IP adrese....\r\nKao interesantnu karakteristiku ovog softvera izdvajam mogućnost kontrole kapije. Radi se o praćenju datuma i vremena dolazaka i odlazaka zaposlenih iz firme. Prema zakonu, neophodno je bilo obezbeđenje i kontrolu ulazaka i izlazaka iz firme prepustiti posebnoj firmi koja bi bila odgovorna za to. To odvojeno preduzeće poseduje sopstvenu bazu podataka, u kojoj se između ostalih unosi SQL zapis pristupa i odlaska iz kruga firme Imol Seval putem identifikacionih kartica koje poseduju svi zaposleni. Takođe, napomenuo bih program ovog softvera koji služi za evidenciju svih radnih stanica valjaonice. On daje podatke o hardveru i softveru datih stanica, antivirusnim programima, IP adresama računara,  koji zaposleni rade na datim računarima, broj telefona kancelarije datog zaposlenog, kao i garancija same opreme. Softver sadrži i poseban odeljak za reklamacije korisnika, gde se može videti opis greške, vrsta greške, vrsta proizvoda koji se reklamira, iz koje države je korisnik koji reklamira proizvod, rešenje reklamacije itd...\r\nGrafički korisnički interfejs nekih stranica programa (koje su naravno, dostupne zaposlenima sa odgovarajućim ovlašćenjima) je prikazan u nastavku:"},{"number":2,"complete":true,"content":"Alcad d.o.o. predstavlja slovenačku firmu široko poznato kao jednu od vodećih kompanija za razvoj poslovnih aplikacija i IT rešenja koja pomažu kompanijama da steknu konkurentsku prednost. Osnovana 1995. godine, kompanija je evoluirala iz računarskog centra Impol, sa ciljem da pređe okvire tadašnje performanse i tržištu ponudi sveobuhvatne poslovne aplikacije i računarsku opremu. Danas, Alcad zapošljava 26 radnika, od kojih se 17 bavi razvojem aplikacija, kombinujući iskustvo, znanje i mladost kako bi implementirali najnovije tehnologije u poslovne procese svojih klijenata. Alcad je odgovoran za upravljanje i održavanje softvera valjaonice Impol Seval Sevojno.\r\n\r\nŠto se tiče usluga koje pruža firma, Alcad nudi širok spektar rešenja prilagođenih potrebama klijenata u različitim industrijama:\r\n\r\n•Poslovna Inteligencija: Kompanija razvija napredna rešenja za podršku odlučivanju na različitim nivoima menadžmenta, uključujući poslovne izveštaje, mobilnu poslovnu inteligenciju, upravljanje rizicima i strateško upravljanje performansama koristeći pristup „Balanced Scorecard“. Takođe nude i rešenja za „data mining“ koja omogućavaju klijentima da bolje analiziraju i koriste svoje podatke.\r\n\r\n•Podrška Poslovanju: Alcad razvija informacioni sistemi za ključne poslovne procese kao što su sistemi za upravljanje proizvodnjom, logistiku i skladištenje, kupovinu, e-trgovinu (B2B), sisteme za upravljanje kvalitetom, marketing i ljudske resurse. Ova rešenja omogućavaju klijentima da optimizuju svoje poslovne procese, povećaju produktivnost i poboljšaju zadovoljstvo krajnjih korisnika.\r\n\r\nPotrebno je napomenuti da je kompanija dugogodišnji partner IBM-a i koristi najmodernije IBM tehnologije u razvoju sofisticiranih poslovnih aplikacija. Njihove ključne tehnologije uključuju:\r\n•Aplikaciona infrastruktura: WebSphere Application Server, WebSphere Process Server, WebSphere Portal Server, DB2, IBM Cognos BI i drugi alati koji omogućavaju brzi razvoj i sigurnu operaciju poslovnih aplikacija.\r\n•Razvojni alati: Rational porodica alata, IBM Cognos za razvoj aplikacija visokih performansi.\r\n•Sistemski alati: WebSphere Business Monitor, Tivoli Storage Manager i drugi sistemi za nadzor i upravljanje IT infrastrukturom.\r\n•Hardver:  IBM System z, z/VSE pružaju visoke performanse i pouzdanost potrebnu za kritične poslovne operacije.\r\n\r\nAlcad nudi sveobuhvatne usluge koje obuhvataju:\r\n•Hostovanje Servera i Aplikacija: Upravljanje centrom podataka visokih performansi sa naprednim sigurnosnim merama i tehničkom podrškom.\r\n•Upravljanje i Nadzor Sistema: Automatski nadzor poslovnih aplikacija, servera i mrežnih uređaja, analizu aktivnosti informacionog sistema i upravljanje IT infrastrukturom.\r\n•Arhiviranje i Sigurnost Podataka: Sigurnosno čuvanje podataka, alternativne lokacije za kontinuitet poslovanja i sigurno dugoročno skladištenje podataka.\r\n\r\nFirma  blisko sarađuje sa IBM Slovenija i drugim partnerima, kao i sa akademskim institucijama, kako bi razvili napredne informacione sisteme koristeći najmodernije alate i proizvode kao što su VisualAge, WebSphere i DB2. Alcad kontinuirano ulaže u profesionalni razvoj svojih zaposlenih i teži ka širenju prisustva na domaćem i inostranom tržištu, uz stalno unapređenje efikasnosti, produktivnosti i profitabilnosti. Takođe, kroz svoje usluge kompanija pruža cloud computing  rešenja koja omogućavaju bezbedan i efikasan pristup poslovnim aplikacijama i podacima, čime dodatno poboljšavaju operativnu efikasnost svojih klijenata.\r\n\r\nSeval je mrežna, klijent-server aplikacija razvijena od strane zaposlenog Duška Sokića u Visual Fox Pro 9.0 SP2 okruženju namenjenom prvenstveno tretiranju relacionih baza podataka. U sadašnjem stanju aplikacija obuhvata sledeće module:\r\n\r\n-Valjaonica – proizvodnja i zastoji - omogućava unos podataka o zastojima (knjige rada mašina PJ Valjaonice) pa su raspoloživi i izveštaji o zastojima u vidu pojedinačnih, periodičnih, detaljnih i sumarnih izveštaja. Omogućen je izvoz podataka o aktivnostima održavanja radi kasnijeg eventualnog kreiranja plana budućih remonta. U ovom modulu omogućen je i unos podataka o gotovim proizvodima pa se mogu dobiti i periodični izveštaji o faktorima protoka po kategorijama proizvoda, periodični sumarni izveštaji o faktorima protoka po debljinama, legurama kao i o faktorima protoka za izabranu kategoriju po legurama i profilima...itd, aktuelni izveštaj o pokazateljima efikasnosti i efektivnosti PJ Valjaonice a može se vršiti i povezivanje brojeva radnih naloga, brojeva šarže i brojeva TRJ. Bitni parametri proizvodnje (FP...) mogu se pratiti preko uvek ažurnih grafikona. \r\nZa odgovorna lica PJ Valjaonica omogućen je unos podataka o stimulacijama zaposlenih kao i dobijanje odgovarajućih izveštaja."},{"number":3,"complete":true,"content":"-Livnica  – proizvodnja i zastoji - omogućava unos podataka iz knjiga šarže, livenja, frezovanja, prijema internog otpatka, metala sa livenja i sečenja i dobijanje detaljnih, sumarnih, periodičnih izveštaja o šaržiranju, livenju, frezovanju, prijemu internog otpatka, preradi šljake. Takođe ovde se nalaze izveštaji o faktoru protoka livnice, gubitku metala, škartu i kategoriji ’’pušteno uz odobrenje’’ livnice, a sve ovo u zavisnosti od parametara period, legura, profil, pogon, tip odlivka...itd. Ovde se mogu dobiti podaci o proizvodnji livnice od januara 2005. godine. Bitni parametri proizvodnje (FP, škart...) mogu se pratiti preko uvek ažurnih grafikona. \r\nU ovom modulu (i ovoj bazi podataka) unose se i podaci o zastojima (knjige rada mašina PJ Livnice) pa su raspoloživi i izveštaji o zastojima u vidu pojedinačnih, periodičnih, detaljnih i sumarnih izveštaja. Omogućen je izvoz podataka o aktivnostima održavanja radi kasnijeg eventualnog kreiranja plana budućih remonta. U ovom segmentu mogu se dobiti i izveštaji o poreklu šarži, šaržni listovi, karte šarži, aktuelni izveštaj o pokazateljima efikasnosti i efektivnosti PJ Livnice a može se vršiti i povezivanje brojeva ugovora, brojeva šarže i brojeva radnih naloga PJ Livnice. \r\nZa odgovorna lica PJ Livnice omogućen je unos podataka o stimulacijama zaposlenih kao i dobijanje odgovarajućih izveštaja.\r\n\r\n-Sirovine - omogućava unos podataka o sirovinama: primarnom i sekundarnom aluminijumu kao i dobijanje odgovarajućih periodičnih sumarnih izveštaja o primljenim količinama sekundarnog aluminijuma po vrstama (u i van zone ST), o prosečnim cenama sekundara po tržištima (domaće i uvoz)...itd. Bitni parametri (prosečne cene sekundara isl.) mogu se pratiti preko uvek ažurnih grafikona.\r\nOd aprila 2017. preko obrazaca Zahtev za odobrenje, Odobrenja, Otprema i normativi i Proizvodnja u ili van ZST omogućen je unos podataka u vezi odobrenja Carinarnice za postupak oplemenjivanja u slobodnoj zoni i razduženja repromaterijala u slobodnoj zoni. Omogućen je i import podataka o proizvedenim količinama u tabelu zaliha, kao i dobijanje dokumenata u vezi aktivnosti sa Carinarnicom. Kreirani su i normativi kao dokumenti o procentualnom učešću sirovina u gotovom proizvodu...itd.\r\n-Transport - omogućava unos podataka o prevoznicima i transportnim turama kao i dobijanje odgovarajućih detaljnih, sumarnih, periodičnih izveštaja o transportu po prevoznicima, državama, transportnim turama i istovarnim mestima, izveštaja o troškovima transporta, o blagovremenosti tura a daje i pregled rangiranja prevoznika po propisanim kriterijumima. U meniju Grafikoni raspoloživi su uvek ažurni dijagrami: transportnih tura po danima i transportnih tura i istovarnih mesta po prevoznicima.\r\n-Final - modul koji je počeo sa radom aprila 2015. godine, a unosom podataka o kupcima i fakturama omogućava dobijanje odgovarajućih izveštaja (pregled faktura po kupcima...isl.)"},{"number":4,"complete":true,"content":"-Tehnika d.o.o. - Magacin gotovih proizvoda - omogućava sve elemente za klasično magacinsko poslovanje: unos podataka iz skladišnih listova, otpremnica, povratnica...i sl. kao i dobijanje odgovarajućih izveštaja, štampanje otpremnica itd.\r\n\r\n-Dokumenti i postupci kvaliteta – omogućava unos podataka o zahtevima za odobrenje isporuke neusaglašenog proizvoda, uvoz podataka o reklamacijama gotovih proizvoda iz Reportera, unos podataka o izmenama u tehnološkim procesima, kao i dobijanje odgovarajućih izlaznih rezultata u vidu izveštaja i dijagrama. Biblioteka dokumenata kvaliteta je baza dokumenata i postupaka kvaliteta i u ovom modulu je dostupna korisnicima.\r\n-Lična zaštitna sredstva (koristi se od jula 2014. s pauzom od decembra 2016. god. do novembra 2019. god.) - modul koji pruža mogućnosti evidencije izdavanja i skladištenja, planiranja nabavke LZS, praćenja izdavanja LZS po zaposlenom, definisanje skupa LZS za zaposlenog u zavisnosti od njegovog radnog mesta... Obezbeđeni su raznovrsni pojedinačni, periodični i sumarni izveštaji, kao i drugi izlazni rezultati (izvoz tabela u željeni format...)\r\n\r\n-Simulacije - modul kreiran za potrebe izrade nekih projektnih zadataka sa nizom interesantnih izveštaja o proizvodnji u periodu od 2007. do 2008. godine\r\nZa sve module : omogućen je izvoz tabela u nekoliko karakterističnih formata (.XL5, .CSV, .DIF, .TXT),   kao i štampanje izveštaja u .PDF formatu. Takođe, svaku tabelu pripadajuće baze podataka moguće je filtrirati po nekom kriterijumu. U meniju Grafikoni mogu se dobiti dijagrami kursa € i LME (€/t)  za aktuelni period (neki od meseci u zadnjih godinu dana, zadnjih godinu ili dve dana).\r\n\r\n\r\n\r\nEkran aplikacije\r\nPočetni ekran aplikacije daje neke osnovne informacije o poslovanju kao što su:\r\n•srednji kurs € [RSD/€]\r\n•LME [€/t]\r\n•Proizvodnja neto: Ukupno /L/TV/HV/B [t] za:\r\n-prethodni dan\r\n-tekuću sedmicu"},{"number":5,"complete":true,"content":"-prošlu sedmicu\r\n-tekući mesec\r\n-tekuću godinu\r\ni prikazuje dijagrame neto proizvodnje za tekući mesec i tekuću godinu za sve četiri kategorije proizvoda (L, TV, HV i B) i izgleda ovako:\r\n \r\n\r\nDesni klik na ekran daje kontekstni meni sa najčeće traženim izveštajima, dijagramima i sl. Paleta sa komandnim dugmadima na desnoj strani omogućava pristup dijagramima proizvodnje, zastoja i faktora protoka.\r\nAplikaciju trenutno koristi preko 60 korisnika sa preko 27400 časova rada godišnje. Prosečno mesečno se pregleda preko 1680 izveštaja, odštampa preko 150, izvrši više od 50 prenosa (“download”) sa servera na matični računar (ovo su podaci za 2023. godinu).\r\n \r\nKomunikacija se obavlja satelitskom vezom, pa se kao jedan od problema navode i vremenske (ne)prilike na krajnjim lokacijama. Windows-ovom uslugom Remote Desktop je vršeno podešavanje klijenta i rešavanje problema koje su zaposleni prijavljivali na svojim računarima, u okviru poslovnog softvera. \r\nVršen je Update softvera Seval:\r\nNa lokalnom računaru je ažuriran program, napravljena je izvršna (.exe) datoteka.\r\nIzvršna datoteka je prebačena da deljeni direktorijum.\r\nPristupa se serveru, ustanovilo se koliko klijenata u datom trenutku koristi aplikaciju. Takođe se može pristupiti i njihovim konkretnim računarima radi uvida u to šta se u datom momentu radi.\r\nSvim klijentima koji su trenutno aktivni u aplikaciji je poslato obaveštenje da se izloguju na dva minuta radi ažuriranja programa.\r\nKlijenti koji se nisu izlogovali iz aplikacije (iz razloga što nisu videli poruku, trenutna odsutnost idt.) su izlogovani sa servera.\r\nIz deljenog računara je izvršna datoteka kopirana u direktorijum programa na serveru. U Backup-u je sačuvana prethodna verzija aplikacije.\r\nProgram je dostupan za dalje korišćenje."},{"number":6,"complete":true,"content":"Na narednoj slici se vidi serverski prikaz aplikacije koje su koristile softver Seval u trenutku kada je bilo potrebno ažirirati pomenutu aplikaciju.\r\n \r\n\r\nFirma je ugradila video-sistem za nadzor (Digital-Video Surveillance System DVS2000) radi nadgledanja procesa proizvodnje. Potreba se ogleda u tome da je veoma bitno znati šta se dešava u svakom trenutku, prvenstveno iz bezbednosnih razloga. Monitoring je omogućen sa više mesta u okviru firme, prema odgovarajućim ovlašćenjima. Vršen je servis i podešavanja sistema kamera i izvedeni su zaključci kako unaprediti sistem. \r\n\r\nBezbednost informaciono-komunikacionog sistema firme Impol Seval je zasnovana na Aktu o bezbednosti informaciono-komunikacionog sistema koji definiše mere zaštite, principe, načine i procedure za postizanje i održavanje adekvatnog nivoa bezbednosti IKT sistema, kao i ovlašćenja i odgovornosti u vezi sa bezbednošću i resursima sistema. Akt se primenjuje na Impol Seval i sva zavisna društva u okviru sistema Impol Seval, obezbeđujući doslednu primenu mera zaštite. U daljem tekstu biće naglašena i objašnjena načela akta, na osnovu kojih se zasniva rad Društva.\r\nOsnov za donošenje ovog Akta proizilazi iz zakona, s obzirom na to da Društvo obrađuje posebne vrste podataka o ličnosti. Bezbednost informacionog sistema je ključna za poslovanje Društva, jer je poslovanje u velikoj meri zavisno od funkcionisanja IKT sistema. Akt takođe postavlja ciljeve kao što su određivanje procedura za bezbednost sistema, sprečavanje i ublažavanje posledica incidenata, podizanje svesti zaposlenih o važnosti informacione bezbednosti, i unapređenje informacione bezbednosti kroz proveru usklađenosti primene mera zaštite.\r\nSvi zaposleni su obavezni da primenjuju mere zaštite IKT sistema i da budu upoznati sa sadržajem Akta. Lice odgovorno za informatičku bezbednost prati primenu mera i proverava da li su podaci zaštićeni u skladu sa Aktom i internim procedurama. Administrator IKT sistema koordinira sa odgovornim licem za informatičku bezbednost i rukovodiocima organizacionih celina.\r\nPosebne mere zaštite obuhvataju rad na daljinu, korišćenje mobilnih uređaja, i zaštitu informacija tokom celokupnog životnog ciklusa podataka, uključujući kreiranje, obradu, skladištenje, prenos, brisanje i uništavanje informacija. Takođe, identifikuju se informaciona dobra i određuju odgovornosti za njihovu zaštitu.\r\nPristup informacijama i informacionim dobrima omogućen je samo onim osobama koje imaju poslovnu “potrebu da znaju”. Pristupne grupe i profili se definišu na način koji omogućava dodeli ili oduzimanje prava pristupa celokupnoj grupi odjednom. Svaka osoba ima pristup samo onim informacionim dobrima, kao što su IT oprema, aplikacije, postupci, prostorije, koja su neophodna za obavljanje njenih zadataka. Fizička i elektronska sredstva za pristup, kao što su ključevi, identifikacione kartice, korisnička imena i lozinke, moraju se čuvati sa velikom pažnjom i ne smeju se pozajmljivati. Podaci za pristup smatraju se poverljivim, a svako gubljenje ili krađa pristupnih sredstava mora se odmah prijaviti kao informacioni bezbednosni incident.\r\nZa svaki informacioni sistem potrebno je uspostaviti proceduru za dodelu, promenu i prestanak prava pristupa. Pristup je dozvoljen samo onima koji su za to ovlašćeni i odgovarajuće osposobljena. Odobrenje pristupa i sprečavanje neovlašćenog pristupa ključni su faktori, a registracija korisnika vrši se uz odobrenje lica zaduženog za informacionu bezbednost. Korisnička imena moraju biti jednoznačna, i u izuzetnim slučajevima se može dozvoliti upotreba grupnih imena, ali samo iz poslovnih razloga. Korisnicima kojima je prestao radni odnos pristup se odmah onemogućava, a svake godine vrši se preispitivanje prava korisnika.\r\nPotrebno je napomenuti da su administratorska prava odvojena od običnih korisničkih prava i dodeljuju se kroz formalni postupak. Administratori moraju koristiti svoje privilegije smao kada je to apsolutno neophodno za administraciju sistema. Korisnici sa posebnim pravima ne smeju  koristiti grupna korisnička imena, a njihova administratorska prava se redovno pregledaju i proveravaju.\r\nPristup informacionim sistemima mora biti omogućen samo kroz odgovarajuću autentifikaciju, poput jake i komplekse lozinke ili drugih bezbednih načuna autentifikacije. Zajednička korisnička imena su dozvoljena samo u izuzetnim situacijama, a kada je reč o poverljivim informacijama, moraju se koristiti jaki načini autentifikacije. Lozinke moraju biti jedinstvene, ne smeju se deliti ili beležiti na nebezbedan način, i moraju se redovno menjati. Impol Seval preduzima mere kako bi sprečio neovlašćen fizički pristup objektima, prostorijama i zonama gde se nalaze sredstva IKT sistema. Fizička zaštita uključuje zaključavanje prostorija, kontrolu ulaska, tehničke sisteme zaštite, i redovne kontrole sistema. U štićenim prostorima primenjuju se protivpožarne mere i obezbeđuje stalno dežurstvo vatrogasne jedinice. Pristup štićenim prostorima je strogo kontrolisan i dozvoljen samo ovlašćenim pojedincima. Svi posetioci se evidentiraju, a pristup se odobrava samo za specifične, autorizovane svrhe. Evidencija o ulasku vodi se elektronski i u fizičkim zapisima, a prava pristupa redovno se preispituju i ažuriraju.\r\nŠto se tiče zaštite opreme, oprema se postavlja na način koji smanjuje rizik od neovlašćenog pristupa i pretnji iz okruženja. Oprema koja služi za obradu osetljivih podataka postavlja se na zaštićena mesta, a redovno se prate uslovi okoline, poput temperature i vlažnosti. Prostorije sa opremom moraju biti redovno čišćene i održavane, a konzumiranje hrane i pića u blizini opreme je strogo zabranjeno."},{"number":7,"complete":true,"content":"Važno je napomenuti kako se u Aktu ističe da korisnici informacionog sistema ne smeju sami instalirati programsku opremu, osim uz dozvolu odgovornog lica. Instalacija, održavanje i ažuriranje te opreme isključiva su nadležnost administratora informacionog sistema. Svaka radna stanica mora imati instaliranu odgovarajuću antivirusnu zaštitu, a po mogućnosti i zaštitni zid sa odgovarajućim bezbednosnim postavkama. Da bi se obezbedila sigurnost i stabilnost sistema, razvojna, ispitna i operativna okruženja moraju biti međusobno razdvojena, čime se smanjuje rizik od neovlašćenog pristupa ili promena u operativnom okruženju. Za ispravno i bezbedno funkcionisanje sredstava za obradu podataka, kao i za primenu radnih procedura, odgovoran je inženjer informacionog sistema. Impol Seval je usvojio radne procedure koje obuhvataju detaljna upustva za izvršenje različitih poslova, kao što su instalacija i konfiguracija sistema, obrada i rukovanje informacijama, izrada rezervnih kopija, planiranje aktivnosti, rešavanje grešaka i vanrednih stanja, kao i postupanje prema poverljivim podacima, Takođe, uključene su procedure za ponovno pokretanje sistem u slučaju otkaza, upravljanje sistemskim zapisima i nadgledanje aktivnosti u sistemu.\r\nNadzor, prilagođavanje i projektovanje resursa informacionog sistema vrši se u skladu sa predviđenim kapacitetima kako bi se osigurale optimalne performanse sistema. U okviru ovih aktivnost periodično se vrše brisanja zastarelih podataka, povlačenje iz upotrebe aplikacija i sistema, optimizacija procesa i rasporeda, te ograničavanje propusnog opsega za usluge koje nisu kritične za poslovanje.\r\nVažno je pomenuti da je pristup internetu je zaposlenima omogućen za rad, obrazovanje i informisanje. Zaposleni moraju koristiti internet u skladu sa etičkim i moralnim normama, i svi korisnici informacionih sistema moraju biti svesni da se an internetu prikazuju sa mrežnom adresom društva. Pri upotrebi informacija sa Interneta, korisnik je dužan da poštuje zakonske propise u vezi sa autorskim pravima i drugim pravima intelektualne svojine. Društvo može ograničiti pristup određenim sadržajima kako bi obezbedilo informacione bezbednosti i sprečilo kršenje etičkih normi. Takođe, može anonimno pratiti upotrebu interneta i unapred blokirate posetu određenim internet stranicama ako to negativno utiče na poslovanje. U slučaju neuobičajenog ponašanja informacionog sistema, korisnik je dužan da to prijavi kao informaciono-bezbednosni incident. Vremenski ograničeno pregledanje šifriranog saobraćaja SSL  za poznate ciljne naslove u svrhu otkrivanja zloupotreba dozvoljeno je samo uz prethodno obaveštenje korisnika.\r\nNa radnim mestima mora biti onemogućen uvid u ekran ili upotreba informaciono-komunikacione opreme neovlašćenim licima. Radna mesta treba organizovati tako da se spreči prilika za “gledanje preko ramena”. Oprema koja se koristi treba da automatski isključi ekran ili prebaci na čuvar ekrana zaštićen lozinkom nakon određenog vremena korisnikove neaktivnosti. Na kraju radnog procesa potrebno je odjaviti se iz sistema i isključiti radnu stanicu, osim ako nije drugačije određeno.\r\nBitno je napomenuti da ugovori sa pružaocima usluga koji imaju pristup informacijama, sredstvima ili opremi za obradu informacija moraju sadržati odredbe o zaštiti poverljivosti. Pružaoci usluga mogu imati pristup samo onim informacijama koje su neophodne za pružanje usluga. Pre početka pregovora, pružalac usluga mora potpisati izjavu o poverljivosti, koja uključuje obavezu da se informacije koriste samo na način odobren od strane Impol Sevala. Izjava mora sadržati odredbu o poverljivosti sa jasno utvrđenim obavezama i odgovornostima pružaoca usluga, uz pretnju raskida ugovora i naknade štete u slučaju povrede. Impol Seval uspostavlja mere nadzora i zaštite za vreme pružanja usluga i nakon završetka posla kako bi održao ugovoreni nivo informacione bezbednosti Ugovorom treba jasno definisati kriterijume ocene, postupak izveštavanja, praćenja i ocene izvršenih usluga. Evaluacija kvaliteta usluga može se vršiti prikupljanjem podataka od korisnika ili putem upitnika. Ugovor mora omogućiti kontinuirano upravljanje promenama usluga, uključujući održavanje i unapređenje procedura i kontrolu bezbednosti informacija. Takođe, Impol Seval primenjuje mere za obezbeđivanje kontinuiteta poslovanja u narednim okolnostima kako bi IKT sistem bio brzo funkcionalan. Vlasnici informacionih izvora određuju prioritete za ponovni rad na osnovu rizika i važnosti. Plan oporavka dokumentuje tehničke detalje za obnovu sistema i ažurira se pri svakoj promeni okruženja. Testiranje plana oporavka vrši se pri svakoj većoj promeni sistema ili najmanje jednom godišnje.\r\nInformacije koje prolaze kroz javne mreže treba zaštiti od malverzacija, neovlašćenog otkrivanja i modifikovanja. Neophodno je potvrditi identitet korisnika i izvršiti podelu ovlašćenja i odgovornosti za postavljanje sadržaja, elektronsko potpisivanje ili obavljanje transakcija. Informacije uključene u transakcije aplikativnih usluga moraju biti zaštićene kako bi se sprečio nepotpun prenos, pogrešno usmeravanje, neovlašćeno menjanje poruka, razotkrivanje, kopiranje ili ponovno emitovanje. Transakcije treba da podrže sledeće uslove: obe strane koje učestvuju u transakciji moraju primeniti elektronski potpis; privatnost svih strana mora biti zaštićena; komunikacioni kanali treba da budu šifrovani i bezbednost protokola koji se koriste u transakcijama mora biti osigurana. \r\n\r\nObaveza Društva kao operatora IKT sistema od posebnog značaja je da najmanje jednom godišnje izvrši proveru sistema i eventualne izmene Akta o bezbednosti radi provere adekvatnosti mera zaštite, procedura, ovlašćenja i odgovornosti. Nepoštovanje bilo koje od odredbi Akta povlači disciplinsku odgovornost zaposlenog. Svi zaposleni i radno angažovani pojedinci koji koriste IKT sistem moraju potpisati izjavu o poverljivosti i zaštiti podataka."}],"mimeType":"text/plain"}