{"sections":[{"number":1,"complete":true,"content":"1. Upoznavanje sa firmom\r\n2. Upoznavanje sa istorijatom firme\r\n3. Upoznavanje sa asortimanom proizvoda\r\n4. Upoznavanje sa tržištom firme\r\n\r\nImpol D.O.O iz Slovenske Bistrice je privredno društvo sa zavidnom poslovnom tradicijom koja datira još od 1825. godine, a preradom aluminijuma bavi se od 1950. Delatnost poslovne grupe IMPOL je prerada aluminijuma u valjane, presovane, vučene, kovane, i druge vrste proizvoda koji se mogu upotrebljavati u automobilskoj i avio indrustriji, mašinogradnji, transportu, unutrašnjem dizajnu, elektroindustriji i građevinskoj industriji. . U Impol-u je zaposleno 2525 radnika koji proizvedu i prodaju preko 110 000 tona proizvoda godišnje. Najvažnija tržišta su tržište Nemačke, Italije, Mađarske, Holandije, zemalja Latinske Amerike, Francuske i Austrije. Poslovna grupa IMPOL obuhvata 21 privredno društvo a njeno matično društvo je IMPOL 2000, d.d. U oktobru 2002. godine IMPOL d.d. je postao vlasnik 70% akcija Valjaonice Aluminijuma iz Sevojna.\r\n\r\n\r\nValjaonica je počela sa radom 1975. godine sa instaliranim kapacitetima od 35.000 tona valjanih aluminijumskih proizvoda. Završetkom druge faze od 16.500 tona programa tankih traka postavljen je projektovani kapacitet od 51.500 tona hladno valjanih proizvoda. Do 1989. godine Valjaonica Aluminijuma iz Sevojna je poslovala u sastavu SOUR Valjaonica Sevojno, a potom, godinu dana (1990) kao jedinstveno preduzeće Valjaonica Bakra i aluminijuma Sevojno. Početkom 1991. Valjaonica aluminijuma nastavlja da posluje samostalno, sa pogonom Finalizacije u svom sastavu. Svojinska transformacija preduzeća izvršena je tenderskom prodajom u oktobru 2002. godine, a vlasnik 70% kapitala postaje IMPOL d.d. Slovenska Bistrica. Od tada Valjaonica nastupa na tržištu pod imenom IMPOL SEVAL Valjaonica aluminijuma a.d. Sevojno. IMPOL SEVAL Valjaonica aluminijuma a.d. Sevojno je najveći prerađivač aluminijuma u Republici Srbiji i jedini proizvođač valjanih proizvoda od aluminijuma, ima višedecenijsku tradiciju u preradi aluminijuma i visok ugled kako na domaćem, tako i na svetskom tržištu, posebno u Evropi i Americi. Impol Seval Valjaonica Aluminijuma Sevojno je danas akcionarsko društvo sa tri ćerke firme: Impol Seval Tehnika, Impol Seval PKC, Impol Seval Final.\r\n\r\nAsortiman proizvoda Impol Seval valjaonice aluminijuma obuhvata sledeće proizvode: bojene trake i limovi, hladno valjane trake, toplo valjane trake, toplo valjane ploče, limove i trupce. Najperspektivniji proizvod valjaonice jeste bojeni aluminijum i on je ujedno i proizvod sa najvećom dodatnom vrednošću. Obojeni aluminijum Valjaonice IMPOL SEVAL Sevojno može se naći u konstrukciji mnogih svetskih poznatih građevina, kao što su: Stadion Lušnjiki u Moskvi koji je služio za otvaranje Svetskog prvenstva u fudbalu 2018. godine, Moskovski metro, Moskovski aerodrom, Humo Arena u Uzbekistanu  i mnoge druge građevine.  Proizvodi Impol Sevala arhitektama dozvoljavaju slobodu i maštovitost i kao što je rekao generalni direktor i vlasnik kompanije ALUWALL, Stanislav Kovaljev: ,,Zadovoljavaju najstrože i najzahtevnije zamisli i ideje arhitekata, omogućavajući veliki broj čitavih paleta boja, nijansi i faktura bojenog aluminijuna”. Sa obzirom da kvalitet proizvoda zavisi od stepena modernizacije proizvodnih sistema, Valjaonica je potrošila 90 miliona evra u razvoju proizvodnih kapaciteta u poslednih 15 godina. Na osnovu toga, može se reći da su Valjaonici Impol Seval Sevojno nema reči o pukom valjanju i bojenju već o gotovo umetničkom duhu i marljivom predavanju radu.\r\n\r\n\r\nŠto se tržišta tiče, Impol Seval valjaonica Aluminijuma je fabrika sa četrdeset godina iskustva u preradi aluminijuma pa je samim tim rezultat toga brzo prilagođavanje zahtevima tržišta i potrebama kupaca, što je doprinelo visokom ugledu i prepoznavanju brenda kod mnogobrojnih kupaca na tržištu Evrope (Nemačka, Italija, Francuska, Austrija, Holandija, Švajcarska...), Rusije i širom sveta. Impol Seval izrađuje proizvode od aluminijuma i njegovih legura, postupcima livenja, toplog valjanja i hladnog valjanja. Proizvodi se izrađuju po zahtevima kupaca i svetskim standardima, u ekološko kontrolisanoj sredini i koriste se u: automobilskoj, prehrambenoj, farmaceutskoj, transportnoj industriji, elektroindustriji i građevinarstvu. Gotova roba doprema se kupcima na najfleksibilniji način korišćenjem šlepera  nosivosti do 25 tona. Vrednost izvoza Valjaonice samo za 2017. godinu iznosi 97,3 miliona evra. Ukupna proizvodnja za tržište 2022. godine je iznosila 1 076 710 tona proizvoda, od čeka se 95% koristi kao izvoz u razne zemlje sveta. Za plasman datih proizvoda na probirljivom svetskom tržištu neophodna je i logistička podrška laboratorije, koja je opremljena najsavremenijom opremom i sprovodi hemijska, mehanička i tehnološka ispitivanja. Valjaonica posluje u skladu sa standardom ISO 9000:2001.\r\n\r\nNakon svoje prve posete firmi, upoznavanja sa delatnostima firme i kadrovima, akcentovao bih organizovanost i međusobnu povezanost zaposlenih u cilju obavljanja postavljenih i predviđenih redosleda složenih zadataka. U okviru menadžmenta preduzeća, kao poseban element izdvojio bih poštovanje pravila poverljivosti. Na osnovu Ugovora koji je potrebno potpisati, obuhvataju se opšte napomene i posebna pravila koja se odnose na treća lica odnosno posetioce Društva koja se po bilo kom osnovu nalaze u radnoj okolini. Od posetilaca se traži da poštuju polise firme o poverljivim informacijama i da se zalažu da date informacije neće zloupotrebiti.\r\nTakođe bih iz svoje prve posete istakao bezbednost kadrova koja je digunuta na visok nivo, gde bezbednost predstavlja jedan od najvažnijih elemenata poslovanja firme. Ona podrazumeva zabranu kretanja bez prisustva mentora ili ovlašćenog zaposlenog i u odgovarajućim zonama kretanja je potrebno imati zaštitnu opremu kao i ovlašćeno lice pored sebe. Posetiocima se takođe daje Ugovor kojim se obavezuju da će poštovati pravila o bezbednosti na radu prilikom posete.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nDATUM: 02.08.2024.\r\nDAN: Petak\r\n\r\n\r\nSADRŽAJ\r\n\r\n\r\n1. Upoznavanje sa informaciono-komunikacionim sistemom firme\r\n2. Upoznavanje sa hardverom firme\r\n3. Upoznavanje sa telekomunikacijama\r\n4. Upoznavanje sa radom zaposlenih\r\n\r\nDrugog radnog dana sam upoznat sa funkionisanjem informacionog sektora firme, njegovom infrastrukturom i telekomunikacijama, hardverom i radom zaposlenih.\r\nInformacioni sektor firme se nalazi u okviru posebnog objekta i izdvojen je od izvesnog broja sektora, pa tako i od proizvodnje firme. Zaposleni u ovom sektoru obavljaju široki raspon informatičkih zadataka, od servisa personalnih računara, preko odružavanja-unapređenja postojeće računarske mreže, do pisanja-održavanja-unapređivanja sopstvenog informacionog sistema/softvera firme. Informacionu i komunikacionu strukturu mreže valjaonice možemo videti na sledećoj slici:\r\n \r\nSa slike možemo videti da se komunikacija sa serverima i mrežom u Slovenskoj Bistrici vrši preko dva linka, jedan direktan link sa Slovenijom preko Telesistema, optički link od 20 Mbit/s i on služi za direktnu komunikaciju sa serverima u Sloveniji. Sa obzirom da sve mora da funkcioniše u redudansi, jer valjaonica ne može dozvoliti pad mreže, u slučaju pada jednog linka prebacuje se na drugi, rezervni link od 200 Mbit/s koji je takođe preko optike (Telekomov link), pa korisnici ne osećaju da je uopšte došlo do promene prilikom pada jednog od linkova. Optički prsten linkova i redudansa omogućavaju što manji rizik od prekida mreže. Na samom ulazu u mrežu imamo dva firewall-a koji su takođe u redudansi i  koriste kompletnu mrežu (tipovi firewall-ova su Palo Alto PA-820). Takođe, mreža sadrži centralne svičeve koji su raspoređeni u hijerarhiji, od centralnog sviča Cisco Catalyst 4500, preko Cisco Catalyst 3850 do Cisco Catalyst 2960. Računarska mreža valjaonice je u osnovi napravljena 2003. godine i tada se koristila multimodna optika, od 2018. se prelazi na singlmodnu optiku koja nema ograničenja u brzini i omogućuje usluge High Speed Internet-a. Između svičeva se koristi singlmodna optika, gde se multimodna pojavljuje vrlo retko. Brzina interneta od 10 gigabita po sekundi predstavlja kičmu mreže tako da nema probema sa brzinom protoka podataka. Potrebno je napomenuti da postoji i ugrađena bežična mreža, gde su veliki troškovi održavanja i licenciranja bežične mreže. Za kontrolu bežične mreže se koristi Cisco Catalyst 9800 bežični kontroler koji zapravo nije deo hardvera (ne postoji fizički, već je instaliran) i on upravlja svim pristupnim tačkama valjaonice. Pristpune tačke su postavljene na svakih 50 metera u pogonu i zaposlenima je veoma bitno da odgovarajući uređaji, kao što je bar kod čitač, mogu brzo preći sa jedne pristupne tačke na drugu. Prikaz dela informacionog sektora firme:\r\n\r\n\r\n U informacionoj komunikacionoj strukturi valjaonice koriste se sledeći serveri: DNS serveri (centri podataka koji služe za povezivanje sa dva velika centra u Sloveniji), File server, LDAP, RDP, server aplikacije za evidenciju radnog vremena, server aplikacije za obradu zarada, server za skeniranje E-fakture. U Sloveniji postoje backup-ovi svih servera, gde se održavanje podataka vrši svakog dana u 22:00. Kao server se  koristi Lenovo SR350, kao diskovni sistem se korsiti IBM skladište, za dodeljivanje memorije i procesora imamo VMWhare za kog se plaćaju odgovarajuće licence. Firma Arhides je odgovorna za celokupnu hardversku i informaciono komunikacionu infrastrukturu valjaonice.\r\n\r\nImpol Seval a.d. poseduje lokalnu telefonsku i računarsku mrežu kojom su pokrivene sve administrativne i proizvodne celine. Lokalna računarska mreža je izvedena kombinacijom optičkih i bakarnih kablova, tako da su proširenja moguća i lako izvodljiva. Računarska mreža se sastoji od više čvorišta, gde se nalaze ormari sa aktivnom i pasivnom računarskom opremom, vezanih u prsten. Do svih čvorova dolazi optički (multimodni i singlmodni) kablovi za računarsku i višeparični bakarni za telefonsku mrežu. Optičkim kabolvima su povezane i sve mašine u pogonu, jer se bakarni kablovi ne mogu koristiti zbog velikih elektro magnetnih smetnjni. Bakarni SFTP kablovi su korišćeni za povezivanje od ormara do radnog mesta. Istim kablovima se prenosi i računarska i telefonska veza. \r\nRačunare firme možemo razvrstati na NC (Network Client) radne stanice, personalne računare sa operativnim sistemima Win2003, Tao-Linux, RedHat, Win98, WinXP, WinVista i Win7.\r\nIP blokovi adresa koji se kriste u mrežama su 10.50.10.0/24 i 20.50.10.0/24 a dalje je planski predviđeno deljenje prema potrebama firme u sistemu\r\n-od 1 do 29 – namenjeno štampačima;\r\n-od 30 do 200 – namenjeno za PC-je;\r\n-od 201 do 254 – namenjeno za NC-je.\r\n\r\nTelefonski saobraćaj se odvija preko sopstvene centrale GrandStream UCM6302, koja se može proširivati. Trenutno na centralni je instalirano 30 IP telefonskih priključaka i 192 analogna lokala različitih prioriteta. Veza sa Softnet serverima ostvaruje se preko 2 MB/s tunela odvojenog od Telekomovog link High Speed Internet. Impol Seval poseduje numeraciju za 300 brojeva od 031 591 100 do 031 591 400. Pored fiksnih telefonskih linija, Impol Seval a.d. poseduje Biznis paket 150 mobilnih telefona. Mobilne telefone poseduju svi rukovodioci, poslovođe i zaposleni na radnim mestima od bitnog značaja za funkcionisanje proizvodnje. Što se tiče bezbednosti, perimetar je zaštićen sistemom Fiber-fance, koji je integrisan sa pokretnim kamerama. Video zapis se redovno snima i čuva, a monitoring se vrši 24 časova dnevno. Za monitoring zadužena je Valjaonica bezbednost. Video kamerama su pokriveni i pojedini delovi proizvodnje. Ove kamere su integrisane u lokalnu računarsku mrežu Impol Seval i video zapisi se skladište na dva lokalna NVR uređaja.\r\n\r\n \r\nDATUM: 05.08.2024.\r\nDAN: Ponedeljak\r\n\r\n\r\nSADRŽAJ"},{"number":2,"complete":true,"content":"1. Upoznavanje sa softverom firme\r\n2. Delnik Infosistem – Delphi baziran softver\r\n3. Rad u programu Delnik Infosistem\r\n\r\nSvog trećeg radnog dana bio sam upoznat sa softverom, aplikacijama, programima i bazom podataka valjaonice. Slovenska firma Alcad je zadužena za održavanje i upravljanje softverom Valjaonice Impol Seval Sevojno, ipak pre njene privatizacije zaposleni su pravili lokalne programe za svoje potrebe. Jedni od takvih programa su Delnik Infosistem i Seval. Danas se uglavnom koriste gotove aplikacije za unos podataka, pravljenje izveštaja, knjigovodstvo, platne programe, osobne dobitke, evidenciju radnog vremena, evidenciju i nabavku osnovnih sredstava. Za praćenje proizvodnje se koristi program PIS koji podrazumeva: praćenje proizvodnih poslova, prodajnih poslova, administrativnih poslova, praćenje nivoa skladišta, odpremnica i nabavnih poslova.\r\nDelnik Infosistem je lokalni mrežni softver razvijen putem programskog okruženja Delphi, i služi za obradu podataka iz procesa koji nisu obuhvaćeni glavnim softverom za praćenje proizvodnje. Program je u stalnom razvoju od 2000-te godine i pruža mogućnosti praćenja podataka o računarima, zaposlenima, odeljku za posete, ličnom dohotku, daje mogućnost ocene radnika, evidenciju tehničke dokumentacije, sadrži u sebi i program za merno-kontrolna sredstva, program za reklamacije, evidencije kupaca i evidencije država za izvoz. Ukratko, Delnik Infosistem se koristi za internu evidenciju: praćenje kadrova i najrazličitijih procesa u firmi. \r\nU biti svega je baza podataka Paradox kao tip baze kojo pristupa program radi rada sa podacima u lokalu (lokalna baza podataka). Sam program je pisan OOP načinom, uz poštovanje brojinh konvencija. Odgovarajući pristup podacima je dostupan na svim radnim stanicama u firmi, u skladu sa odgovarajućim ovlašćenjima i odgovornostima. Prema tome, odgovarajuće jedinice programa su dostupne licima koje rade sa njima, i to u prilagodnom obliku: mogućnost ažuriranja podataka, pregled podataka, upis-brisanje podataka itd. Dakle,  u dogovoru sa menadžmentom i ostalim zaposlenima, dodeljene su odgovarajuće privilegije, koje je moguće menjati putem prigodnog interfejsa. U bazi programa postoji oko 50 tabela od kojih se kao najbitnije mogu istaći tabele vezane za radnike, reklamacije, prolaske i izlaznice iz firme, sirovine IP adrese....\r\nKao interesantnu karakteristiku ovog softvera izdvajam mogućnost kontrole kapije. Radi se o praćenju datuma i vremena dolazaka i odlazaka zaposlenih iz firme. Prema zakonu, neophodno je bilo obezbeđenjee i kontrolu ulazaka i izlazaka iz firme prepustiti posebnoj firmi koja bi bila odgovorna za to. To odvojeno preduzeće poseduje sopstvenu bazu podataka, u kojoj se između ostalih unosi SQL zapis pristupa i odlaska iz kruga firme Imol Seval putem indentifikacionih kartica koje poseduju svi zaposleni. Takođe, napomenuo bih program ovog softvera koji služi za evidenciju svih radnih stanica valjaonice. On daje podatke o hardveru i softveru datih stanica, antivirusnim programima, IP adresama računara,  koji zaposleni rade na datim računarima, broj telefona kancelarije datog zaposlenog, kao i garancija same opreme. Softver sadrži i poseban odeljak za reklamacije korisnika, gde se može videti opis greške, vrsta greške, vrsta proizvoda koji se reklamira, iz koje države je korisnik koji reklamira proizvod, rešenje reklamacije itd...\r\nGrafički korisnički interfejs nekih stranica programa (koje su naravno, dostupne zaposlenima sa odgovarajućim ovlašćenjima) je prikazan u nastavku: \r\n \r\n \r\n \r\n\r\n\r\nDATUM: 06.08.2024.\r\nDAN:Utorak\r\n\r\n\r\nSADRŽAJ\r\n\r\n\r\n1. Seval – Visual Fox Pro baziran softver\r\n2. Korisnički rad i upravljanje softverom Seval\r\n\r\n\r\nSeval je mrežna, klijent-server aplikacija razvijena u Visual Fox Pro 9.0 okruženju namenjenom prvenstveno tretiranju relacionih baza podataka. Sa druge strane, aplikacija je primer „object-oriented, data-centric and event-driving“ aplikacije i funkcioniše na Win32 platformi. Praktično, to znači da je serverski deo aplikacije na severu sa Windows 2000 operativnim sistemom a klijentski omogućava posredstvom OLE kontrola uključenih u Visual Fox Pro 9.0 pristup serveru sa računara u mreži radi korišćenja njegovih resursa. Grafički utisak koji aplikacija ostavlja je u drugom planu a u centru pažnje su podaci i njihova manipulacija radi kreiranja preglednih izveštaja neophodnih za donošenje brzih poslovnih odluka. U sadašnjem stanju aplikacija obuhvata sledeće module:"},{"number":3,"complete":true,"content":"•Proizvodnja, otprema i zalihe gotovih proizvoda\r\n•Zastoji i bilansi valjaonice\r\n•Parametri livnice\r\n•Modul rezervni delovi\r\n•Evidencija podataka o brušenju valjka\r\n•Postupci i dokumenti kvaliteta\r\n•Transport\r\n•Izvoz\r\n\r\n\r\nUvodni obrazac i upravljanje odgovarajućim prozorima su prikazani na sledećim slikama:\r\n \r\nDakle, odatle se dalje pristupa čitavoj aplikaciji i svim njenim (dostupnim) elementima i stranama, štampanju obrazaca itd, u zavisnosti od odgovarajućih korisničkih privilegija.\r\n  \r\n\r\nSoftver je baziran na integralnom sistemu označavanja predmeta poslovanja (materijalnih i nematerijalnih) sa realizacijom u obliku paralelnog sistema.\r\nOznaka jednog predmeta u paralelnom sistemu sastoji se od:\r\noindentifikacionog broja;\r\nozapisa osnovnih podataka i\r\noklasifikacionog broja\r\nčiji je međusobni raspored nezavisan.\r\n\r\nKarakteristike aplikacije:"},{"number":4,"complete":true,"content":"-Skalabilnost (aplikacija se lako širi dodavanjem odgovarajućeg segmenta sa pripadajućom bazom podataka, stavkama u glavnom meniju za unos podataka i pregled izveštaja, obrascima za unos podataka i odgovarajućim izveštajima).\r\n-Distribuiranost baze podataka (podaci su organizovani u više nezavisnih baza podataka, „database container“, u zavisnosti od procesa za koji su neposredno vezani, što omogućava njihove nezavisne dorade u smislu dodavanja novih tabela, polja ili izgradnje indeksa).\r\n-Mogućnost daljinskog nadgledanja (zahvaljujući hibridnoj kombinaciji Windows 2000 i Visual Fox Pro-a 9.0 administrator sistema može daljinski nadgledati rad korisnika radi upoznavanja sa problemima i greškama u radu, davanja korisniku objašnjenja o nekim mogućnostima aplikacije, ili radi preuzimanja kontrole nad računarom korisnika radi bezbednog izlaska iz aplikacije u slučaju „pucanja“ programa. Takođe, administrator može po potrebi poslati korisnicima poruku da završe započete radnje i izanu iz aplikacije radi njenog ažuriranja, unosa ispravki ili dodavanja novih mogućnosti ili, u hitnim slučajevima, odjaviti korisnika bez upozorenja ukoliko je to neophodno.Unos ispravki je brz (minut-dva) jer se radi samo o kopiranju nove .exe datoteke (koja je ranije već pripremljena) preko postojeće.\r\n-Lak prelaz iz jedne u drugu bazu podataka u zavisnosti od prava pristupa dodeljenih svakom korisniku. Glavni meni i paleta sa alatkama je „context sensitive“ tj. raspoložive opcije zavise od tekuće baze podataka.Pomenuti selektivan pristup segmentima aplikacije s druge strane reguliše pravo korisnika da pored pregleda izveštaja vrši i unos podataka.\r\n-Mogućnost izvoza (export) podataka sa servera na računar korisnika u nekom od uobičajenih formata (.xls, .txt, .dif i .csb) radi kasnije obrade, slanja e-mailom, eventualnog uvoza u neki drugi program... itd. Preduslov za ovo je postojanje odgovarajuće fascikle sa deljenim, punim pristupom na računaru korisnika.\r\n-BackUp podataka (vrši se automatski pri prvom dnevnom ulasku u aplikaciju a podaci skladište na serveru za zadnjih deset dana ili ga po potrebi izvršava administrator na izabrani računar u mreži).\r\n-Veliki broj raspoloživih izveštaja (preko 300).\r\n-Pored ovoga, često, dešava se da se paralelno sa korišćenjem ove aplikacije mora raditi i u nekoj drugoj koja je na lokalnom računaru. Korisnik ne mora izlaziti iz aplikacije – dovoljno je da pritisne taster Start na tastaturi i naći će se u novom ambijentu – u svom lokalnom okruženju.\r\n-Aplikaciji se može pristupiti i van radnog mesta (npr. od kuće) putem daljinskog pristupa. Za to je neophodno postojanje sledećih preduslova: modemi na oba računara (na radnom mestu i kod kuće), konfigurisane pozivne (odnosno dolazne) veze na oba računara, uključen računar na radnom mestu (nije neophodno da bude prijavljen u mrežu). \r\nAplikaciju trenutno koristi 60 korisnika sa preko 2860 časova rada godišnje. Prosečno mesečno se pregleda preko 1280 izveštaja, odštampa skoro 150, izvrši više od 18 prenosa (“download”) sa servera na matični računar i radi 10 proračuna. Aplikacija se prosečno 2 puta dnevno ažurira (“update”)."}],"mimeType":"text/plain"}